var ta = document.getElementById("knownwords-textarea");
var knownSlider = document.getElementById('known-slider');
const enableAutoAddChar = document.getElementById('auto-add-char').checked;



var mostFrequentChars = '的一是不了在人有我他這個們中來上大為和國地到以說時要就出會可也你對生能而子那得於著下自之年過發後作裡用道行所然家種事成方多經麼去法學如都同現當沒動面起看定天分還進好小部其些主樣理心她本前開但因只從想實日軍者意無力它與長把機十民第公此已工使情明性知全三又關點正業外將兩高間由問很最重並物手應戰向頭文體政美相見被利甚二等產或新己制身果加西斯月話合回特代內信表化老給世位次度門任常先海通教兒原東聲提立及比員解水名真論處走義各入幾口認條平系氣題活爾更別打女變四神總何電數安少報才結反受目太量再感建務做接必場件計管期市直德資命山金指克許統區保至隊形社便空決治展馬科司五基眼書非則聽白卻界達光放強即像難且權思王像完設式色路記南品住告類求據程北邊死張該交規萬取拉格望覺術領共確傳師清今切院讓識候帶導爭運笑飛風步改收根幹造言聯持組每濟車親極林服快辦議往元英士證近失轉夫令準布始怎呢存未遠叫台單影具羅字愛擊流備兵連調深商算質團集百需價花黨華城石級整府離況亞請技際約示复病息究線似官火斷精滿支視消越器容照須九增研寫稱企八功嗎包片史委乎查輕易早曾除農找裝廣顯吧阿李標談吃圖念六引歷首醫局突專費號盡另週較注語僅考落青隨選列武紅響雖推勢參希古眾構房半節土投某案黑維革劃敵致陳律足態護七興派孩驗責營星夠章音跟志底站嚴巴例防族供效續施留講型料終答緊黃絕奇察母京段依批群項故按河米圍江織害鬥雙境客紀採舉殺攻父蘇密低朝友訴止細願千值仍男錢破網熱助倒育屬坐帝限船臉職速刻樂否剛威毛狀率甚獨球般普怕彈校苦創假久錯承印晚蘭試股拿腦預誰益陽若哪微尼繼送急血驚傷素藥適波夜省喜衛源食險待述陸習置居勞財環排福納歡雷警獲模充負雲停木遊龍樹疑層冷洲衝射略範竟句室異激漢村哈策演簡卡罪判擔州靜退既衣您宗積餘痛檢差富靈協角佔配徵修皮揮勝降階審沉堅善媽劉讀啊超免壓銀買皇養伊懷執副亂抗犯追幫宣佛歲航優怪香著田鐵控稅左右份穿藝背陣草腳概惡塊頓敢守酒島托央戶烈洋哥索胡款靠評版寶座釋景顧弟登貨互付伯慢歐換聞危忙核暗姐介壞討麗良序升監臨亮露永呼味野架域沙掉括艦魚雜誤灣吉減編楚肯測敗屋跑夢散溫困劍漸封救貴槍缺樓縣尚毫移娘朋畫班智亦耳恩短掌恐遺固席松秘謝魯遇康慮幸均銷鐘詩藏趕劇票損忽巨砲舊端探湖錄葉春鄉附吸予禮港雨呀板庭婦歸睛飯額含順輸搖招婚脫補謂督毒油療旅澤材滅逐莫筆亡鮮詞聖擇尋廠睡博勒煙授諾倫岸奧唐賣俄炸載洛健堂旁宮喝借君禁陰園謀宋避抓榮姑孫逃牙束跳頂玉鎮雪午練迫爺篇肉嘴館遍凡礎洞卷坦牛寧紙諸訓私莊祖絲翻暴森塔默握戲隱熟骨訪弱蒙歌店鬼軟典欲薩夥遭盤爸擴蓋弄雄穩忘億刺擁徒姆楊齊賽趣曲刀床迎冰虛玩析窗醒妻透購替塞努休虎揚途侵刑綠兄迅套貿畢唯谷輪庫跡尤競街促延震棄甲偉麻川申緩潛閃售燈針哲絡抵朱埃抱鼓植純夏忍頁傑築折鄭貝尊吳秀混臣雅振染盛怒舞圓搞狂措姓殘秋培迷誠寬宇猛擺梅毀伸摩盟末乃悲拍丁趙硬麥蔣操耶阻訂彩抽贊魔紛沿喊違妹浪匯幣豐藍殊獻桌啦瓦萊援譯奪汽燒距裁偏符勇觸課敬哭懂牆襲召罰俠廳拜巧側韓冒債曼融慣享戴童猶乘掛獎紹厚縱障訊涉徹刊丈爆烏役描洗瑪患妙鏡唱煩簽仙彼弗症仿傾牌陷鳥轟咱菜閉奮慶撤淚茶疾緣播朗杜奶季丹狗尾儀偷奔珠蟲駐孔宜艾橋淡翼恨繁寒伴嘆旦愈潮糧縮罷聚徑恰挑袋灰捕徐珍幕映裂泰隔啟尖忠累炎暫估泛荒償橫拒瑞憶鼻鬧羊呆厲衡胞零窮舍碼赫婆魂災洪腿膽津俗辯胸曉勁貧仁偶輯邦恢賴圈摸仰潤堆碰艇稍遲輛廢淨兇署壁禦奉旋冬礦抬蛋晨伏吹雞倍糊秦盾杯租騎乏隆診奴攝喪污渡旗甘耐憑扎搶緒粗肩梁幻菲皆碎宙叔岩盪綜爬荷悉蒂返井壯薄悄掃敏礙殖詳迪矛霍允幅撒剩凱顆罵賞液番箱貼漫酸郎腰舒眉憂浮辛戀餐嚇挺勵辭艘鍵伍峰尺昨黎輩貫偵滑券崇擾憲繞趨慈喬閱汗枝拖墨脅插箭臘粉泥氏彭拔騙鳳慧媒佩憤撲齡驅惜豪掩兼躍屍肅帕駛堡屆欣惠冊儲飄桑閒慘潔踪勃賓頻仇磨遞邪撞擬滾奏巡顏劑績貢瘋坡瞧截燃焦殿偽柳鎖逼頗昏勸呈搜勤戒駕漂飲曹朵仔柔倆孟腐幼踐籍牧涼牲佳娜濃芳稿竹腹跌邏垂遵脈貌柏獄猜憐惑陶獸帳飾貸昌敘躺鋼溝寄扶鋪鄧壽懼詢湯盜肥嘗匆輝奈扣廷澳嘛董遷凝慰厭臟騰幽怨鞋丟埋泉湧轄躲晉紫艱魏吾慌祝郵吐狠鑑曰械咬鄰赤擠彎椅陪割揭悟聰霧鋒梯貓祥闊譽籌叢牽鳴沈閣穆屈旨袖獵臂蛇賀柱拋鼠瑟戈牢遜邁欺噸琴衰瓶惱燕仲誘狼池疼盧仗冠粒遙呂玄塵馮撫淺敦糾鑽晶豈峽蒼噴耗凌敲菌賠塗粹扁虧寂煤熊恭濕循暖糖賦抑秩帽哀宿踏爛袁侯抖夾昆肝擦豬煉恆慎搬紐紋玻漁磁銅齒跨押怖漠疲叛遣茲祭醉拳彌斜檔稀捷膚疫腫豆削崗晃吞宏癌肚隸履漲耀扭壇撥沃繪伐堪僕郭犧殲墓僱廉契拼懲捉覆刷劫嫌瓜歇雕悶乳串娃繳喚贏蓮霸桃妥瘦搭赴岳嘉艙俊址龐耕銳縫悔邀玲惟斥宅添挖呵訟氧浩羽斤酷掠妖禍侍乙妨貪掙汪尿莉懸唇翰倉軌枚鹽覽傅帥廟芬屏寺胖璃愚滴疏蕭姿顫醜劣柯寸扔盯辱匹俱辨餓蜂哦腔鬱潰謹糟葛苗腸忌溜鴻爵鵬鷹籠丘桂滋聊擋綱肌茨殼痕碗穴膀卓賢臥膜毅錦欠哩函茫昂薛皺誇豫胃舌剝傲拾窩睜攜陵哼棉晴鈴填飼渴吻扮逆脆喘罩卜爐柴愉繩胎蓄眠竭餵傻慕渾姦扇櫃悅攔誕飽乾泡賊亭夕爹酬儒姻卵氛洩桿挨僧蜜吟猩遂狹肖甜霞駁裕頑於摘矮秒卿畜咽披輔勾盆疆賭塑畏吵囊嗯泊肺驟纏岡羞瞪吊賈漏斑濤悠鹿俘錫卑葬銘灘嫁催璇翅盒蠻矣潘歧賜鮑鍋廊拆灌勉盲宰佐啥脹扯禧遼抹筒棋褲唉樸咐孕誓喉妄拘鏈馳欄逝竊艷臭纖璣棵趁匠盈翁愁瞬嬰孝頸倘浙諒蔽暢贈妮莎尉凍跪闖葡後廚鴨顛遮誼圳籲崙闢瘤嫂陀框譚亨欽庸歉芝吼甫衫攤宴囑衷嬌陝矩浦訝聳裸碧摧薪淋恥膠屠鵝飢盼脖虹翠崩賬萍逢賺撐翔倡綿猴枯巫昭怔淵湊溪蠢禪闡旺寓藤匪傘碑挪瓊脂謊慨菩萄獅掘抄嶺暈逮砍掏狄晰罕挽脾舟痴蔡剪脊弓懶叉拐喃僚捐姊騷拓歪粘柄坑陌窄湘兆崖驕剎鞭芒筋聘鉤棍嚷腺弦焰耍俯厘愣廈懇饒釘寡憾摔疊惹喻譜愧煌徽溶墜煞巾濫灑堵瓷咒姨棒郡浴媚穌淮哎屁漆淫巢吩撰嘯滯玫碩釣蝶膝姚茂軀吏猿寨恕渠戚辰舶頒惶狐諷笨袍嘲啡潑銜倦涵雀旬僵肢壟夷逸茅僑輿窯涅蒲謙杭噢弊勳刮郊淒捧浸磚鼎籃蒸餅畝腎陡爪兔殷貞薦啞炭墳眨搏咳攏舅昧擅爽咖擱祿雌哨鞏絹螺裹昔軒謬諜龜媳姜瞎冤鴉蓬巷琳栽沾詐齋瞞彪厄諮紡罐桶壤糕頌膨諧壘咕隙辣綁寵嘿兌黴挫稽輻乞紗裙嘻哇繡杖塘衍軸攀膊譬斌祈踢肆坎轎棚泣屢躁邱凰溢椎砸趟簾帆棲竄丸斬堤塌販廂掀喀乖謎捏閻濱虜匙蘆蘋卸沼鑰株禱剖熙嘩劈怯棠胳樁瑰娛娶沫嗓蹲焚淘嫩韻襯匈鈞豎峻豹撈菊鄙魄兜哄穎鎊屑蟻壺怡滲禿迦旱喲咸焉譴宛稻鑄鍛伽詹斃恍貶燭駭芯汁桓坊驢朽靖傭汝碌迄冀荊崔雁紳珊榜誦傍彥醇笛禽勿娟瞄幢寇睹賄踩霆嗚拱妃蔑諭縛詭篷淹腕煮倩卒勘馨逗甸賤炒燦敞蠟囚栗辜墊妒魁謠寞蜀甩涯枕丐泳奎泌逾叮黛燥擲藉樞憎鯨弘倚侮藩拂鶴蝕漿芙垃烤曬霜剿蘊圾綢嶼氫駝妝捆鉛逛淑榴丙癢鈔蹄犬躬晝藻蛛褐頰奠募耽蹈陋侶魅嵐侄虐墮瑩蔭狡閥絞膏垮莖緬喇絨攪凳梭丫姬詔鈕棺耿締懈嫉灶勻嗣鴿澡鑿緯沸疇刃遏爍嗅叭熬瞥骸奢拙棟毯桐砂莽瀉坪梳杉晤稚蔬蠅搗頃麼尷鏢詫尬硫嚼羨淪滬曠彬芽狸冥碳咧惕暑咯蘿洶腥窺俺潭崎麟撿拯厥澄萎哉渦滔暇溯鱗釀茵愕瞅暮衙誡斧兮煥棕佑嘶妓喧蓉刪櫻伺嗡娥梢壩蠶敷瀾杏綏冶庇撓摟倏聶婉噪稼鰭菱盞匿吱寢攬髓秉哺矢啪幟邵嗽挾缸揉膩馴纜晌癱貯覓朦僻隋蔓咋嵌虔畔瑣碟澀朧嘟蹦塚瀏裔襟叨訣旭蝦簿啤擒棗嘎苑牟嘔駱凸熄兀喔裳凹贖屯膛澆灼裘砰棘橡鹼聾姥瑜毋婭沮萌俏黯撇粟糞尹苟癲螞禹廖儉帖煎縷竇簇棱叩吶瑤墅鶯燙蛙歹伶蔥哮眩坤廓諱啼乍瓣矯跋枉梗廁琢譏釉窟斂軾廬胚呻綽扼懿炯竿慷虞錘栓槳蚊磅孽慚戳禀鄂饋垣濺咚鈣礁彰豁瞇磷雯墟迂瞻顱琉悼蝴揀渺眷憫汰懾嬸斐噓鑲炕宦趴繃窘襄珀囂拚酌濁毓撼嗜扛峭磕翹槽淌柵頹熏瑛頤忖牡綴徊梨肪涕憊摹踱肘熔摯氯凜繹庶脯迭睦竅粥庵滄怠沁奕嚨氨矗盔拇沛榻揣嶄鞘鞠墾洽唾櫥仕蜘痰襪峙柬蟬蟹諫鵑擎皓朕疤禺鏟酶鈍氓匣弧峨錐揪槓吭崛誣冉抒庚悍靡晦醋壕鋸夭咦侈婢猾徘硝煽皂舵嗦狽靴捂瘡郝苛穢茜搓芸醬賃簷餉蕉鈾苔赦緞舷筷朔婪紊廝婿寥兢糙卦槐扒裴祀埔絮芭屜瘓霄綻宵邑霖岔餌茄韌琪鄒瑚憋殆嚕忒忿釁淳悖髦孜粵隘瀕錚畸剔塢籬淀驀唬鑼汀趾緝嫦斟鞍扳拴詛謨呃懦逞犁懺擰亥佟叱舜絆龔腮邸椒蔚湛狩眶棧薇骯瀑渣褂嘰臀妞巍唔疚鯉戎肇篤轍嫻阮札懊燾卹疹瀟鋁滌恃嘍砌遁楞阱咎窪炳噬楓拷哆磯葦翩窒儂靶胰蕪辮嚎妾幌踉佃葫皖拽濾睬俞匕謗嗤捍孵倪癮敝匡磋綾淆堯蕊烘璋亢軋賂蝗榆駿誅勺梵熾笠頜閘狒樊鎔垢瘟繆菇琦剃迸溺炫惚嗨隕贓羈臻嘀膳贛躊殉桔瞿閩豚摻沌惰喳橢咪霎侃猝窖戮祠矚菁躇佬肋咄忡雍忱蕾蹌矽伎炊蝠屎拭諦褪丞卉隧茸鉗啃伢閨舔蹬攣眺袱隴毆柿梧惺弛僥琛捅醞薯曳澈銹稠眸咆簧鷗瘍瀆汲嬉膿騾穗檻拎巳邢廿攙曙樵隅篩謁倭痺猖佯肛奚甭抨蛾嘮熒嵩漱酋攘詰篡睿噩悵盎徙鞅漓祟睫攸翎嗆筐塹檀寅磊馭惘吠馱瑙炬痙曝愷胺螢敕箏幡霹竺烙毗鳩埠蒜阜嘈乒帷啄鰲氈闕褥搔筍冕獰韶骼藹烹奄嫖沐噗岑蛟擄詠弩捻圃孚悴詣呱祁捶鈉襖澎氮恪雛撮堰彷鸚暉犀腑沽橄掐褻齲嗒咀祺錨匾乓萃貽揖覷吝憔羌誨礫蠕餚撩坍酥裊黝俾嫣穹秧妊溉鵲聿疙蘑睾楷酵茹鋅滇輾纂圭幔褒揍誹倔腓頡鋤嗔磺攢瘩靂吆悚墩彝囪逍輒桅儼綸悸殃幀俐綺袒籽孰愫拌橙暨敖贅抉淤剌娼頊葵噥酣麓缽瑯簸禾銖璧娠彗惋腋螂阪掣劾瀝粱嚓憚氖捎羔俟渲欖繭霓鵡胥琶撬橘醫拈笆痊亟渭狙珂刨蛻諺憧瞟饅拗帚釵哧喋簫刁怦繚迥湄磐渝冗閔噶黏蕃弼驛淄餃踞韜婷唆蜒偎榨漉碉皈矜笈枷鯊躡瀚謔癖燼揩炙蜷侏凋漪悻蹋訕搐碘帛詮碾擂苯訶鐸戊荀駒攫憬哽踵蟒漾嘖吮楠氟慫叼竣偕漩蹭翌臆撾絢崽糜瘢跤闌恬豢汶蹺琵憨蝸螅惴戟匱恙抿楨箋蛤瞳藥瓢衹秤跺潦芹噠飭栩曦骷嫡鹵丕鬢梓嗖惦浚咔藐荃唧璽汛銬髏渤皿箍餡汾戍痔褶聆涎汞漬奐巔疣儺逵耆蟋鱷訛膺躥筏釜沂坯巒茬摒蟀攆滸繽嵋瓏苞瑾泵鉀曖賡叟佚沓撂蠱甥璐晏癟漳閹蹂鰓璉湃轆僭躪鼾懵鐮寐褚攥澗蝙臍轅渙杞煜驥傣噯禎酉秸捺瑕鑫饞窿楔胱荔蟆湍屹遐軻鐲韁樺燉鋇羚嗇詡緋掖籙涸鴛塾呸掄擻熹坷甕亙嗟筵跛汕歟壑潁溥姍踴梟暄稷跚漣瀛笙滕踝貳瞰惻嚏迢獗邯瞼贍縈珥酮璞羹緘晾俸媲鸞恿蜿犢訥扈蜈翟藕戌蓓鋆謾諛卯諳岐蠍荼鍍椰甄蟾蹊濘擼螃檬猓薔羲瘸蘸蔗傀蚌錮遽邃恚皚鏘簌焙昊鸛睽劊鱉噎唄寰唷殯淖誥恣睞嬋櫚氦靳蛹鴦愜蹙詼眈罡繕胤皋蛀偌疵絳葆黔喙烽儡佼斕嬪顎齦盅娓坂町芥瘠閡挎橇薈啜垛淇瓚簍蝨躋龕蹣髯瞠癇掂潼酰鎂灸腆筱諄騁壬茗椋蛔潺扉耘檳雹甬諡淞燎蕙蚪蜻鄲軼猙楣捋涓蓀婁麝蚤薰醮搪謐湮輟瞌梆樟茉嶇臼癬穡玷饃呷萼嫵佇彤莓岬媛惆鰨啾囔蜓孺徇徵焊岱暱卅飆邙痞隼恫愴桀綬襠盂檜蚓摳嗷槌痘痢芮蚣閂鏗颶皰蝌撅蚯斡窠莢耷硯牒賑煦囁耙榕韃袤諶醺稈徨櫓翡纓鍬嵇圪髻嗬輜痣娩諂蛐鷂翱庖籟蓿鰻瘧鮎這嚅瘀頷黜黠瀨餒洵忐忑砥咂罹糠匝偃淙紉喏閭祛蟄靦澇曜厩疽閏洄煊汐蘚璜鉻經渥靼酗苓噤咫椿鯽錠罔鍾匍祗錳岌馀畹糯脛熠鑾沅棣旌豌孢鐳駙醃盹熵鎬饈嚶癩骰韭闔瞑裨宕戾鐫溟牘雋婊鵠埂拄媧虯萱啵蠡芋胭豺啻褸蛆檸掰篆倌嚀蛭謖蕁莞澹紜潞郅弋颼螳冑蟑猥宓曇鐧蟠過柑烯匐濮蟮祐仄偈蜃箴粼嗥襤蕨薊圩孿杳魘葷諉簪氳摞颯鏤舀夙臧蒿貂蜥蹩噼鈦钚獾濂鎧晰靄鱸叵霾泯碴鴕峪饕瘁睢鬃邇紂夔垠飩榭娑篝榔洌浜鮭諤汩浣舐瞭忻咻鶉唑懋皎詒麾輳氐冽箕俚汴宸芍捱擯摺簦箔噝孀怏諞砧馕耄罌漕灃欒矩烷榷俑沱縝鷲螄剽衢泗臊瘴酚紓晁孛煬叁憩掬欏囓畿撣鐐驍椽侗灤藎泓蚱癜酯體癸蚜捫廡歆蝮蹶弈庋喟滂啕蠣獺槁翊齪鄴莘燮剁覲鐺讒鎳臃墒曄燔嘭涿醯籮鄱睨諍坳鷺砷唏伲猬琥歿蚩涇縹殮鰍氰詆芻芷嶙逅舫囈唰茁饉媯驤苷擢峋袂懣蓑與淶祉踹掇沏誑噫餑飪綹諮飧迳鍘樅熨鋈葒賒儔戛湎么凇芪觶齷撻嬴苻嘁韉肽慟迨鈺儆覦訖滓僮媾齜胯涮綰杈赳斛觥疸卞慍拮庠燁和菠窈罄囤弁奘咣繅腴緲喵潢遛柚郟荻藜琨鑣雉橐陽駢蛉艮搽濡寮柩佗啷詵視僂夯闈諼夥枸臏虻筠埽笞臾婀珞粑怵綣殞覬嶗顴嗑榛昱蜴鱔噙淼礬硼囿泅邂鉅蠹堊乩嗝淦樽誚揆啐淅櫸馗轡暹騖魷苫獷獠詈竦篙諢鉸餛蜚峒瀅琬靚狻璨犟鸕蟎芩嘹錕蜇洹櫛儷釷鍁瑁壹痿竑粕犄瘙餞摶衲踮齙愎馥梏訃艿趺鱘剜縐罅笥衩姣斫鶚腎爻獼晗鎩窕仨搡崴酢檄佞孑璀岷舛邕闓鉑霽犒餾閾麋麒蓯摁涔宥妍鋌鍔嗲惲麂贗胛哂擷呶撅懍櫟桎霰饗揄噔娣薏忝吒嗵迤賁臚鍪瀘蔫刈僖咿鵪嗪蘢茯​​岫嶸軲懟銓昕郢咩餿髡澧苣濯盥囡礪佘讖弒楂翦怩蠼霏楹謳鍥慵胝砭濰杵樾幗碣謅徠胴鈷裟啶銑銥楫赭磧酊魑醛剮畦陂閌鬮祚鶻泱趄驊陲鄖倜呤燧鉉粲骶峁忸淥騫髭戡鎢譎莧鋥蜊幄闥戕驪虢燴儻妲絀椏袈槍藪撳杲肓厝蒞氤縉袞詬旖硒唁嬗硎裱顰質靨紇煨礴鏖蟈笏羿鼐湟甑煒煲銼筧喑嶂潯弭嫗鋰苡孳頦醴間渚軛鷸蠔黃膘邛癆褡耦覃虛饌篾兗鬩遨爰痂艄耨漚邋焓秣昶種變窣絛俎榫蟪稗謇氬類鍇齬烴俁嬤肱鳶笫痤陰菏莆芨闋砣磣鼴長猷竽舸誆鏨淬隗悌姘槭邈婕歙稹蹴砒癰鎦羯豕魴蓖匭笤崢徭浹烊補窸酆縊褓蚨翳趔炔謄賾仃勗葺蚴瀧蠐結媸俳詿蔦逡孱寨蹕祜伉溴屐飚蛞鏡掮崆庾橛矸鴇';

loadKnownWords();

function loadKnownWords() {
	chrome.runtime.sendMessage({want: "knownwords"}, function(response) {
		ta.value = response.knownwords.join("\n");
		updateNumberOfKnownWords(response.knownwords);
	});
	updateWhatToLearn();	
}



document.getElementById('knownwords-save').addEventListener("click", function(){
	chrome.runtime.sendMessage(
		{want: 'saveall', overwrite:false, input: ta.value.split('\n')},
		function(response) {
			alert("Successfully saved " + response.knownwords.length + " words.");
			loadKnownWords();
		});
});

document.getElementById('knownwords-overwrite').addEventListener("click", function(){
	chrome.runtime.sendMessage(
		{want: 'saveall', overwrite:true, input: ta.value.split('\n')},
		function(response) {
			alert("Successfully saved " + response.knownwords.length + " words.");
			loadKnownWords();
		});
});

function numberOfUniqueChars(words) {
	var knownChars = new Set();
	for (var i=0; i<words.length; i++) {
		for (var j=0; j<words[i].length; j++) {
			knownChars.add(words[i][j]);
		}		
	}
	return knownChars.size;
}

function updateNumberOfKnownWords(knownWords) {
	document.getElementById('number-of-words').innerHTML = knownWords.length;
	document.getElementById('number-of-characters').innerHTML = numberOfUniqueChars(knownWords);
}

function updateSliderLabel(val) {
	document.getElementById('known-slider-label').value = val + " ("+ Math.round(10000*val/mostFrequentChars.length)/100 +"%)";
}

knownSlider.addEventListener('input', function(event){
	updateSliderLabel(event.target.valueAsNumber);
});


document.getElementById('known-slider-submit').addEventListener("click", function(){
	var howMany = knownSlider.value;
	
	chrome.runtime.sendMessage(
		{want: 'saveall', overwrite:false, input: mostFrequentChars.substring(0, howMany).split('')},
		function(response) {
			alert("Successfully saved " + response.knownwords.length + " characters.");
			loadKnownWords();
		});
});

updateWhatToLearn();
function updateWhatToLearn() {
	chrome.runtime.sendMessage({want: "knownwords"}, function(response) {
		knownwords = new Set(response.knownwords);
		var firstUnknown = -1;
		var stillWant = 10;
		var charsToLearn = '';
		for (var i=0; i<mostFrequentChars.length;i++){
			if (!knownwords.has(mostFrequentChars[i])) {
				if(firstUnknown === -1) { firstUnknown = i; }
				charsToLearn += mostFrequentChars[i];
				stillWant--;

				if(stillWant==0) break;
			}
		}
		knownSlider.value = firstUnknown;
		updateSliderLabel(firstUnknown);
		document.getElementById('should-learn').innerHTML = charsToLearn;
	});
}

/* Add when implemented enableAutoChar button correctly. 
chrome.runtime.onMessage.addListener(
	function(request, sender, sendResponse) {
		if(request.want == "enableAutoAddChar") {
			sendResponse({enableAutoAddChar: enableAutoAddChar})
		}
	});
*/